package solution;

import java.util.Scanner;

public class S22 {

	public static void main(String[] args) {
		// 멀리 뛰기
		// 명진이는 멀리 뛰기를 연습하고 있습니다. 1번에 1칸 혹은 2칸 밖에 뛸 수 없
		Scanner sc = new Scanner(System.in);
		int input = sc.nextInt();

		System.out.println(jumpCase(input));

		sc.close();
	}

	private static int jumpCase(int e) {
		// 피보나치 수열 저장
		// 1	1	2	3	5	8	13	21	34	55 ...
		// e 값으로 주소를 찾아 반환
		e++; // 배열 인덱스가 0부터 시작함으로
		int[] array = new int[e+1];
		
		for (int i = 0; i < array.length; i++) {
			array[i] = fibonacci(i);
		}
		
		return array[e];
	}

	private static int fibonacci(int n) { // 피보나치 수열 메소드
		if (n <= 1) {
			return n;
		} else {
			return fibonacci(n-2) + fibonacci(n-1);
		}
	}

}

// 1 -1- 1

// 2 -2- 11
// 2

// 3 -3- 111
// 12
// 21

// 4 -5- 1111
// 112
// 121
// 211
// 22

// 5 -8- 11111
// 1112
// 1121
// 1211
// 2111
// 122
// 212
// 221

// 6 -13- 111111
// 11112
// 11121
// 11211
// 12111
// 21111
// 1122
// 1212
// 1221
// 2112
// 2121
// 2211
// 222

// 7 -21- 1111111
// 111112
// 111121
// 111211
// 112111
// 121111
// 211111
// 11122
// 11212
// 11221
// 12112
// 12121
// 12211
// 21112
// 21121
// 21211
// 22111
// 1222
// 2122
// 2212
// 2221

// 8 -34- 11111111
// 1111112
// 1111121
// 1111211
// 1112111
// 1121111
// 1211111
// 2111111
// 111122
// 111212
// 111221
// 112112
// 112121
// 112211
// 121112
// 121121
// 121211
// 122111
// 211112
// 211121
// 211211
// 212111
// 221111
// 11222
// 12122
// 12212
// 12221
// 21122
// 21212
// 21221
// 22122
// 22212
// 22221
// 2222